# 데이터 로딩과 저장

In [1]:
%pwd

'C:\\Users\\sweet\\Desktop\\코딩\\numpy+pandas'

In [2]:
!dir

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: E461-57B5

 C:\Users\sweet\Desktop\코딩\numpy+pandas 디렉터리

2021-07-26  오후 04:42    <DIR>          .
2021-07-25  오후 12:35    <DIR>          ..
2021-07-26  오후 04:42    <DIR>          .ipynb_checkpoints
2021-07-22  오후 02:30               570 array_archive.npz
2021-07-26  오후 03:25            21,913 auto-mpg.csv
2021-07-26  오후 04:42                72 csv파일 다루기!.ipynb
2021-07-26  오후 04:41    <DIR>          examples
2021-07-26  오후 04:40           889,052 examples.zip
2021-07-26  오전 09:49           127,295 image.png
2021-07-22  오전 09:42           375,435 np+pd (1day).ipynb
2021-07-23  오전 10:12           205,447 np+pd (2day).ipynb
2021-07-23  오후 05:45           252,270 np+pd (3day).ipynb
2021-07-26  오후 03:21           300,498 np+pd (4 day).ipynb
2021-07-23  오후 05:46    <DIR>          numpy-pandas
2021-07-21  오후 05:32           182,704 psj.png
2021-07-26  오후 04:37            90,844 자동차 연비 분석  (탐색 및 통계 요약).ipynb
              11개 파일           2,446,100 바이트
               5개 디렉터리   3,737,313,280 바이트 남음

In [8]:
!type examples\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [10]:
import numpy as np
import pandas as pd

In [12]:
df = pd.read_csv('examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
df.columns

Index(['a', 'b', 'c', 'd', 'message'], dtype='object')

In [24]:
pd.read_table('examples/ex2.csv', sep=',') #read_table가 좋은건 여러 파일을 커버할 수 있다 read_csv처럼 csv only가 아니다

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [17]:
!type examples\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [22]:
df = pd.read_csv('examples/ex2.csv', header=None)
df
#header가 있으면 0번째 행이 컬럼으로 간다.

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [23]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message']) #이런식으로 지정할 수 도 있다.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [26]:
names = ['a', 'b', 'c', 'd', 'message']
pd.read_csv('examples/ex2.csv', names=names, index_col='message') #이러면 인덱스가 컬럼에있던 message로 바뀐다. 또는 숫자로 써서 해당 n번째 열이 인덱스로 간다.

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12